// %%%%%%%%%%% 種々の選択肢 %%%%%%%%%%%%%%%%%%%%%%
// %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

export const gender_options = [
    "男", "女"
]

export const role_options = [
    "学部1年","学部2年","学部3年","学部4年","修士1年","修士2年","博士1年","博士2年","博士3年"
];

export const belonging_options = [
    "A大学B学部","C大学D学部","E大学F学部"
]

export const locate_options = [
    "AAキャンパス333居室", "BBキャンパス02教室", "その他"
];

export const purpose_options = [
    "講義","実験","アルバイト","私用"
];

// %%%%%%%%%%% 使用可能なアドレスドメイン %%%%%%%%%%%%%%%%%%%%%%
// %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

export const mail_domain = [
    "gmail.com",
];

// %%%%%%%%%%% フォームチェック時の警告文 %%%%%%%%%%%%%%%%%%%%%%
// %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

export const check_form_signup = [
    "苗字を入力してください",
    "名前を入力してください",
    "役割を選択してください",
    "所属を選択してください",
    "取引先コードを入力してください",
    "財源を選択してください",
    "メールアドレスを入力してください",
    "正しいメールアドレスを使用してください",
    "パスワードを入力してください",
    "パスワードが一致しません",
    "フリガナ(苗字)を入力してください",
    "フリガナ(名前)を入力してください",
    "性別を入力してください",
    "国籍を入力してください",
    "誕生日を入力してください",
];

export const check_form_login = [
    "メールアドレスを入力してください",
    "パスワードを入力してください"
]

export const check_form_update = [
    "苗字を入力してください",
    "名前を入力してください",
    "役割を選択してください",
    "所属を選択してください",
    "取引先コードを入力してください",
    "財源を選択してください",
    "メールアドレスを入力してください",
    "正しいメールアドレスを使用してください",
    "フリガナ(苗字)を入力してください",
    "フリガナ(名前)を入力してください",
    "性別を入力してください",
    "国籍を入力してください",
    "誕生日を入力してください",
];

export const check_form_password = [
    "パスワードを入力してください",
    "パスワードが一致しません"
];


export const check_form_travel_expense = [
    "財源を選択してください",
    "経路情報を登録してください"
];

export const check_form_reference_update = [
    "登録名が他の登録情報と重複します",
    "登録名を入力してください",
    "運賃を入力してください",
    "経路に空白が含まれています"
];

export const check_add_table = [
    "用務先を選択してください",
    "具体的な用務先を記述してください",
    "目的を選択してください",
    "運賃を記入してください",
    "運賃は正の数値で記入してください",
    "経路に空欄が含まれています",
    "参照する経路を選択してください",
    "「経路記入」か「経路参照」のタブを選択してください"
];

export const check_registration = [
    "登録名(エイリアス)を記入してください",
    "運賃を記入してください",
    "運賃は正の数値で記入してください",
    "経路に空欄が含まれています",
];

